Revit 2027 API
FabricationPart.GetPartCustomDataInteger Method
 Get custom data integer value for the specified custom data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetPartCustomDataInteger(
	int customId
)
Public Function GetPartCustomDataInteger (
	customId As Integer
) As Integer
public:
int GetPartCustomDataInteger(
	int customId
)
member GetPartCustomDataInteger :
        customId : int -> int
Parameters
customId Int32
 The identifier of the custom data field to get.
Return Value
Int32
 Returns the integer of the custom data. If the data is not a number it will return 0.
Exceptions
Exception | Condition
ArgumentException |  The custom data does not exist on the part.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace